init.org
#+TODO: TODO(t) | DONE(o)
#+HUGO_BASE_DIR: ./hugo/
#+HUGO_SECTION: ./
#+title: 麦汁三昧
#+author: mugijiru
#+chapter: true
#+toc: headlines 2
#+HUGO_LEVEL_OFFSET: 1

** load-path
   :PROPERTIES:
   :EXPORT_FILE_NAME: load-path
   :END:

*** 概要

    ~load-path~ は Emacs の設定でも重要な項目で
    このリストに追加されている path は ~load~ または ~require~ する際に走査される path となっている。

    即ち load-path を通しておけば、そこに置いている emacs lisp のファイルは簡単に読み出せるようになる。

    なお package-install や el-get を使っておけば基本的に自分で load-path を通す必要はない。

*** 秘匿情報を入れてるフォルダを読み込み可能にする

    パスワードなどの秘匿情報を持っている部分は ~~/.emacs.d/secret~ というフォルダで管理している。
    そのためここに入ってる emacs lisp のファイルも読み込めるように load-path に追加している。

    #+begin_src emacs-lisp :tangle inits/00-load-path.el
    (add-to-list 'load-path (expand-file-name "~/.emacs.d/secret"))
    #+end_src

*** my/load-config                                              :replacement:

    ~~/.emacs.d/secret~ は個人マシンか会社マシンかによって置いてるデータが異なったりするため
    もしもファイルがなくてもエラーにならないような方法で load する方法が必要だった。

    というわけでファイルがなかったら読み込まずにメッセージを出力して終了するような関数を用意している。

    #+begin_src emacs-lisp :tangle inits/00-load-path.el
    (defun my/load-config (file)
      (condition-case nil
          (load file)
        (file-missing (message "Load error: %s" file))))
    #+end_src

    ただ、これって結局

    #+begin_src emacs-lisp
    (load file nil t)
    #+end_src

    で十分な気もするので、置き換えを検討した方が良さそう。

